```

hk@HKs-MacBook-Pro zscaler-security-groups % terraform plan
var.app
  The application name (ab2d, bcda, dpc)

  Enter a value: ab2d

var.env
  The application environment (dev, test, mgmt, sbx, prod)

  Enter a value: dev

var.private_cidrs
  private ip list

  Enter a value: ["192.168.0.0/24","10.0.0.0/24"]

var.public_cidrs
  public ip list

  Enter a value: ["192.168.1.0/24","10.1.0.0/24"]

module.vpc.data.aws_vpc.this: Reading...
module.vpc.data.aws_vpc.this: Read complete after 1s [id=vpc-0c6413ec40c5fdac3]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.zscaler_private will be created
  + resource "aws_security_group" "zscaler_private" {
      + arn                    = (known after apply)
      + description            = "Allow internet zscaler traffic private"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ab2d-dev-allow-zscaler-private"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
      + vpc_id                 = "vpc-0c6413ec40c5fdac3"
    }

  # aws_security_group.zscaler_public will be created
  + resource "aws_security_group" "zscaler_public" {
      + arn                    = (known after apply)
      + description            = "Allow public zscaler traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ab2d-dev-allow-zscaler-public"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
      + vpc_id                 = "vpc-0c6413ec40c5fdac3"
    }

  # aws_vpc_security_group_ingress_rule.zscaler_allow_private["10.0.0.0/24"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "zscaler_allow_private" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/24"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
    }

  # aws_vpc_security_group_ingress_rule.zscaler_allow_private["192.168.0.0/24"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "zscaler_allow_private" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "192.168.0.0/24"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
    }

  # aws_vpc_security_group_ingress_rule.zscaler_allow_public["10.1.0.0/24"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "zscaler_allow_public" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.1.0.0/24"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
    }

  # aws_vpc_security_group_ingress_rule.zscaler_allow_public["192.168.1.0/24"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "zscaler_allow_public" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "192.168.1.0/24"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you
run "terraform apply" now.
Releasing state lock. This may take a few moments...

```